protogia/avr-descriptionfiles-4-nim/svd/ATmega4808.atdf.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>FUSE</name>
      <description>Fuses</description>
      <baseAddress>0x00001280</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x3</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x5</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>APPEND</name>
          <description>Application Code Section End</description>
          <addressOffset>0x7</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>BODCFG</name>
          <description>BOD Configuration</description>
          <addressOffset>0x1</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SLEEP</name>
              <description>BOD Operation in Sleep Mode</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Enabled</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SAMPLED</name>
                  <description>Sampled</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ACTIVE</name>
              <description>BOD Operation in Active Mode</description>
              <bitRange>[3:2]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Enabled</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SAMPLED</name>
                  <description>Sampled</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENWAKE</name>
                  <description>Enabled with wake-up halted until BOD is ready</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SAMPFREQ</name>
              <description>BOD Sample Frequency</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>1KHZ</name>
                  <description>1kHz sampling frequency</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>125HZ</name>
                  <description>125Hz sampling frequency</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LVL</name>
              <description>BOD Level</description>
              <bitRange>[7:5]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BODLEVEL0</name>
                  <description>1.8 V</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BODLEVEL2</name>
                  <description>2.6 V</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BODLEVEL7</name>
                  <description>4.2 V</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>BOOTEND</name>
          <description>Boot Section End</description>
          <addressOffset>0x8</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>OSCCFG</name>
          <description>Oscillator Configuration</description>
          <addressOffset>0x2</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>FREQSEL</name>
              <description>Frequency Select</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>16MHZ</name>
                  <description>16 MHz</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>20MHZ</name>
                  <description>20 MHz</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OSCLOCK</name>
              <description>Oscillator Lock</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCFG0</name>
          <description>System Configuration 0</description>
          <addressOffset>0x5</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>EESAVE</name>
              <description>EEPROM Save</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RSTPINCFG</name>
              <description>Reset Pin Configuration</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO</name>
                  <description>GPIO mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RST</name>
                  <description>Reset mode</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CRCSRC</name>
              <description>CRC Source</description>
              <bitRange>[7:6]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FLASH</name>
                  <description>The CRC is performed on the entire Flash (boot, application code and application data section).</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BOOT</name>
                  <description>The CRC is performed on the boot section of Flash</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BOOTAPP</name>
                  <description>The CRC is performed on the boot and application code section of Flash</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOCRC</name>
                  <description>Disable CRC.</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCFG1</name>
          <description>System Configuration 1</description>
          <addressOffset>0x6</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SUT</name>
              <description>Startup Time</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0MS</name>
                  <description>0 ms</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1MS</name>
                  <description>1 ms</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2MS</name>
                  <description>2 ms</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4MS</name>
                  <description>4 ms</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8MS</name>
                  <description>8 ms</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>16MS</name>
                  <description>16 ms</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>32MS</name>
                  <description>32 ms</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>64MS</name>
                  <description>64 ms</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>WDTCFG</name>
          <description>Watchdog Configuration</description>
          <addressOffset>0x0</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PERIOD</name>
              <description>Watchdog Timeout Period</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Off</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8CLK</name>
                  <description>8 cycles (8ms)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>16CLK</name>
                  <description>16 cycles (16ms)</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>32CLK</name>
                  <description>32 cycles (32ms)</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>64CLK</name>
                  <description>64 cycles (64ms)</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>128CLK</name>
                  <description>128 cycles (0.128s)</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>256CLK</name>
                  <description>256 cycles (0.256s)</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>512CLK</name>
                  <description>512 cycles (0.512s)</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1KCLK</name>
                  <description>1K cycles (1.0s)</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2KCLK</name>
                  <description>2K cycles (2.0s)</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4KCLK</name>
                  <description>4K cycles (4.1s)</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8KCLK</name>
                  <description>8K cycles (8.2s)</description>
                  <value>11</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WINDOW</name>
              <description>Watchdog Window Timeout Period</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Off</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8CLK</name>
                  <description>8 cycles (8ms)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>16CLK</name>
                  <description>16 cycles (16ms)</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>32CLK</name>
                  <description>32 cycles (32ms)</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>64CLK</name>
                  <description>64 cycles (64ms)</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>128CLK</name>
                  <description>128 cycles (0.128s)</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>256CLK</name>
                  <description>256 cycles (0.256s)</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>512CLK</name>
                  <description>512 cycles (0.512s)</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1KCLK</name>
                  <description>1K cycles (1.0s)</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2KCLK</name>
                  <description>2K cycles (2.0s)</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4KCLK</name>
                  <description>4K cycles (4.1s)</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8KCLK</name>
                  <description>8K cycles (8.2s)</description>
                  <value>11</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
