protogia/avr-descriptionfiles-4-nim/svd/ATmega4808.atdf.svd
        <register>
          <name>PORTCTRL</name>
          <description>Port Control</description>
          <addressOffset>0xA</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SRL</name>
              <description>Slew Rate Limit Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>PORTMUX</name>
      <description>Port Multiplexer</description>
      <baseAddress>0x000005E0</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x6</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CCLROUTEA</name>
          <description>Port Multiplexer CCL</description>
          <addressOffset>0x1</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>LUT0</name>
              <description>CCL LUT0</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>LUT1</name>
              <description>CCL LUT1</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>LUT2</name>
              <description>CCL LUT2</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>LUT3</name>
              <description>CCL LUT3</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EVSYSROUTEA</name>
          <description>Port Multiplexer EVSYS</description>
          <addressOffset>0x0</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>EVOUTA</name>
              <description>Event Output A</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DEFAULT</name>
                  <description>EVOUT on PA2</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT1</name>
                  <description>EVOUT on PA7</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EVOUTC</name>
              <description>Event Output C</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DEFAULT</name>
                  <description>EVOUT on PC2</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EVOUTD</name>
              <description>Event Output D</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DEFAULT</name>
                  <description>EVOUT on PD2</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT1</name>
                  <description>EVOUT on PD7</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EVOUTF</name>
              <description>Event Output F</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DEFAULT</name>
                  <description>EVOUT on PF2</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TCAROUTEA</name>
          <description>Port Multiplexer TCA</description>
          <addressOffset>0x4</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TCA0</name>
              <description>Port Multiplexer TCA0</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PORTA</name>
                  <description>TCA0 pins on PA[5:0]</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTB</name>
                  <description>TCA0 pins on PB[5:0]</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTC</name>
                  <description>TCA0 pins on PC[5:0]</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTD</name>
                  <description>TCA0 pins on PD[5:0]</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTE</name>
                  <description>TCA0 pins on PE[5:0]</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTF</name>
                  <description>TCA0 pins on PF[5:0]</description>
                  <value>5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TCBROUTEA</name>
          <description>Port Multiplexer TCB</description>
          <addressOffset>0x5</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TCB0</name>
              <description>Port Multiplexer TCB0</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DEFAULT</name>
                  <description>WO on PA2</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT1</name>
                  <description>WO on PF4</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TCB1</name>
              <description>Port Multiplexer TCB1</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DEFAULT</name>
                  <description>WO on PA3</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT1</name>
                  <description>WO on PF5</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TCB2</name>
              <description>Port Multiplexer TCB2</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DEFAULT</name>
                  <description>WO on PC0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT1</name>
                  <description>WO on PB4</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TCB3</name>
              <description>Port Multiplexer TCB3</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DEFAULT</name>
                  <description>WO on PB5</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT1</name>
                  <description>WO on PC1</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TWISPIROUTEA</name>
          <description>Port Multiplexer TWI and SPI</description>
          <addressOffset>0x3</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SPI0</name>
              <description>Port Multiplexer SPI0</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DEFAULT</name>
                  <description>SPI0 on PA[7:4]</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT1</name>
                  <description>SPI0 on PC[3:0]</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT2</name>
                  <description>SPI0 on PE[3:0]</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>Not connected to any pins</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TWI0</name>
              <description>Port Multiplexer TWI0</description>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DEFAULT</name>
                  <description>SCL/SDA on PA[3:2], Client mode on PC[3:2] in dual TWI mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT1</name>
                  <description>SCL/SDA on PA[3:2], Client mode on PF[3:2] in dual TWI mode</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT2</name>
                  <description>SCL/SDA on PC[3:2], Client mode on PF[3:2] in dual TWI mode</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>Not connected to any pins</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>USARTROUTEA</name>
          <description>Port Multiplexer USART register A</description>
          <addressOffset>0x2</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>USART0</name>
              <description>Port Multiplexer USART0</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DEFAULT</name>
                  <description>USART0 on PA[3:0]</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT1</name>
                  <description>USART0 on PA[7:4]</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>Not connected to any pins</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>USART1</name>
              <description>Port Multiplexer USART1</description>
              <bitRange>[3:2]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DEFAULT</name>
                  <description>USART1 on PC[3:0]</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT1</name>
                  <description>USART1 on PC[7:4]</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>Not connected to any pins</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>USART2</name>
              <description>Port Multiplexer USART2</description>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DEFAULT</name>
                  <description>USART2 on PF[3:0]</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT1</name>
                  <description>USART2 on PF[6:4]</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>Not connected to any pins</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>USART3</name>
              <description>Port Multiplexer USART3</description>
              <bitRange>[7:6]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DEFAULT</name>
                  <description>USART3 on PB[3:0]</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT1</name>
                  <description>USART3 on PB[5:4]</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>Not connected to any pins</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
