protogia/avr-descriptionfiles-4-nim/svd/ATmega4808.atdf.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>VPORTF</name>
      <description>Virtual Ports</description>
      <baseAddress>0x00000014</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>DIR</name>
          <description>Data Direction</description>
          <addressOffset>0x0</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>IN</name>
          <description>Input Value</description>
          <addressOffset>0x2</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>INTFLAGS</name>
          <description>Interrupt Flags</description>
          <addressOffset>0x3</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>INT</name>
              <description>Pin Interrupt</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>OUT</name>
          <description>Output Value</description>
          <addressOffset>0x1</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>VREF</name>
      <description>Voltage reference</description>
      <baseAddress>0x000000A0</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CTRLA</name>
          <description>Control A</description>
          <addressOffset>0x0</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>AC0REFSEL</name>
              <description>AC0 reference select</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0V55</name>
                  <description>Voltage reference at 0.55V</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1V1</name>
                  <description>Voltage reference at 1.1V</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2V5</name>
                  <description>Voltage reference at 2.5V</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4V34</name>
                  <description>Voltage reference at 4.34V</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1V5</name>
                  <description>Voltage reference at 1.5V</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AVDD</name>
                  <description>AVDD</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC0REFSEL</name>
              <description>ADC0 reference select</description>
              <bitRange>[6:4]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0V55</name>
                  <description>Voltage reference at 0.55V</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1V1</name>
                  <description>Voltage reference at 1.1V</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2V5</name>
                  <description>Voltage reference at 2.5V</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4V34</name>
                  <description>Voltage reference at 4.34V</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1V5</name>
                  <description>Voltage reference at 1.5V</description>
                  <value>4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRLB</name>
          <description>Control B</description>
          <addressOffset>0x1</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>AC0REFEN</name>
              <description>AC0 DACREF reference enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC0REFEN</name>
              <description>ADC0 reference enable</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
